InformationRegisters/НастройкиУчетаДоходовПоЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаДоходовПоЦеннымБумагам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиУчетаДоходовПоЦеннымБумагам/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РеквизитФормыВЗначение("Запись").Выбран() Тогда
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Запись.Брокер) 
		И РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Новый Структура("Дата, Организация, Брокер", Запись.Период, Запись.Организация, Запись.Брокер)) Тогда	
		
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Брокер) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|			&Дата,
			|			Организация = &Организация
			|				И Брокер = &Брокер
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Дата, ) КАК УсловияДоговоровОбщиеСрезПоследних
			|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация = УсловияДоговоровОбщиеСрезПоследних.Организация
			|			И КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
			|ГДЕ
			|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
			|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &Дата)";
		
		Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Период);
		Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Брокер", ТекущийОбъект.Брокер);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ТекущийОбъект.СчетДоверительногоУправления);
		
		Если Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета ДУ отсутствует договор с брокером " + ТекущийОбъект.Брокер + ".",,, "Запись.Брокер", Отказ);
		КонецЕсли;
						
		Если ЗначениеЗаполнено(ТекущийОбъект.РасчетныйСчет) И Не РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Новый Структура("Дата, Организация, Брокер", ТекущийОбъект.Период, ТекущийОбъект.Организация, ТекущийОбъект.Брокер)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для брокера " + ТекущийОбъект.Брокер + " не требуется детализация по расчетному счету. Удалите значение расчетного счета.",,, "Запись.РасчетныйСчет", Отказ);	
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры
